Publ/Lenguajes/Go/Go.html
<!doctype html>
<html lang="en">
<head>
<title>Go</title>
<!-- 2021-10-07 Thu 23:25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Basics</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Hello world</a></li>
<li><a href="#sec-1-2">1.2. Paquetes</a></li>
<li><a href="#sec-1-3">1.3. <code>Imports</code></a></li>
<li><a href="#sec-1-4">1.4. Comentarios</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Conceptos básicos</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Variables</a></li>
<li><a href="#sec-2-2">2.2. Tipos de datos</a></li>
<li><a href="#sec-2-3">2.3. Constantes</a></li>
<li><a href="#sec-2-4">2.4. Obteniendo <code>input</code></a></li>
<li><a href="#sec-2-5">2.5. <code>if/else</code></a></li>
<li><a href="#sec-2-6">2.6. <code>switch</code></a></li>
<li><a href="#sec-2-7">2.7. ciclos</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Funciones</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Introducción a funciones</a></li>
<li><a href="#sec-3-2">3.2. Argumentos</a></li>
<li><a href="#sec-3-3">3.3. Argumentos múltiples</a></li>
<li><a href="#sec-3-4">3.4. <code>return</code></a></li>
<li><a href="#sec-3-5">3.5. Múltiples <code>return</code></a></li>
<li><a href="#sec-3-6">3.6. <code>Defer</code></a></li>
<li><a href="#sec-3-7">3.7. Múltiples <code>defer</code></a></li>
<li><a href="#sec-3-8">3.8. Alcance</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Punteros y <code>structs</code></a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. Punteros</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Go</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Basics</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Hello world</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">package</span> main

<span style="color: #ff79c6; font-style: italic;">import</span> <span style="color: #f1fa8c;">"fmt"</span>

<span style="color: #ff79c6; font-style: italic;">func</span> <span style="color: #50fa7b;">main</span><span style="color: #61bfff;">()</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"Hello world"</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Paquetes</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Todo programa de go esta hecho de paquetes (<code>package</code>).
</li>
<li>Siempre se empieza con el paquete <code>main</code>.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">package</span> main
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <code>Imports</code></h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Además del paquete <code>main</code>.
<ul class="org-ul">
<li>Go tiene diferentes paquetes que pueden ser importados.
</li>
</ul>
</li>
<li>El más común es el paquete <code>fmt</code>.
<ul class="org-ul">
<li><code>fmt</code> es por la palabra <code>format</code>, y nos da la habilidad de hacer <code>Imput</code> y <code>Output</code> de manera fácil.
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">import</span> <span style="color: #61bfff;">(</span>
    <span style="color: #f1fa8c;">"fmt"</span>
    <span style="color: #f1fa8c;">"math"</span>
<span style="color: #61bfff;">)</span>
</pre>
</div>

<blockquote>
<p>
Se pueden importar varios paquetes a la vez poniéndolos entre paréntesis.
</p>
</blockquote>

<ul class="org-ul">
<li>Cada paquete tiene palabras claves las cuales pueden ser usadas después de importar el paquete.
<ul class="org-ul">
<li>Cada una de estas palabras siempre empieza con mayúscula.
</li>
</ul>
</li>
<li>En el ejemplo de arriba accedimos a la palabra clave (método) <code>Println</code>.
<ul class="org-ul">
<li>Este escribe texto en la consola.
</li>
</ul>
</li>
</ul>

<blockquote>
<p>
Similar a otros lenguajes <code>func main()</code> es el punto de entrada del programa.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Comentarios</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Podemos poner en nuestro código comentarios.
<ul class="org-ul">
<li>Esto se hace poniendo <code>//</code>, para un comentario de una sola linea.
</li>
<li>Los comentarios multilínea se hacen rodeando el texto con <code>/* */</code>.
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #6272a4; font-style: italic;">// comentario de una sola linea</span>
<span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"go go go go!"</span><span style="color: #61bfff;">)</span>
<span style="color: #6272a4; font-style: italic;">/* comentario</span>
<span style="color: #6272a4; font-style: italic;">   multil&#237;nea */</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Conceptos básicos</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Variables</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Se usan para guardar valores.
</li>
<li>Se usa la palabra clave <code>var</code> para declararlas.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">i</span> <span style="color: #bd93f9;">int</span> <span style="color: #6272a4; font-style: italic;">// var &lt;nombre de la variable&gt; &lt;tipo&gt;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">i</span> <span style="color: #bd93f9;">int</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">8</span> <span style="color: #6272a4; font-style: italic;">// var &lt;nombe&gt; &lt;tipo&gt; = &lt;valor de la variable&gt;</span>
fmt.<span style="color: #bd93f9;">print</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">i</span><span style="color: #61bfff;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>También podemos asignar múltiples variables en una sola linea.
</li>
<li>Go tiene inferencia de tipos.
<ul class="org-ul">
<li>Esto significa que Go puede adivinar el tipo de la variable si a esta le es asignada un valor.
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">i</span>, <span style="color: #ffc9e8;">j</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">69</span>, <span style="color: #8be9fd;">42</span> <span style="color: #6272a4; font-style: italic;">// Go sabe que i y j son int (enteros)</span>
</pre>
</div>

<ul class="org-ul">
<li>Go soporta asignación corta de variables.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffc9e8;">i</span> <span style="color: #ff79c6; font-style: italic;">:=</span> <span style="color: #8be9fd;">8</span>
<span style="color: #ffc9e8;">x</span>, <span style="color: #ffc9e8;">y</span>, <span style="color: #ffc9e8;">z</span> <span style="color: #ff79c6; font-style: italic;">:=</span> <span style="color: #8be9fd;">1</span>, <span style="color: #8be9fd;">2</span>, <span style="color: #8be9fd;">3</span>
</pre>
</div>

<blockquote>
<p>
Este operador automáticamente define e inicializa las variables.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Tipos de datos</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Los tipos de dato más comunes en go son:
<ul class="org-ul">
<li><code>float32</code>
</li>
<li><code>float64</code>
</li>
<li><code>string</code>
</li>
<li><code>bool</code>
</li>
</ul>
</li>
</ul>

<blockquote>
<p>
La diferencia entre <code>float32</code> y <code>float64</code> es la precisión, <code>float64</code> representara el número con mayor precisión en los decimales.
</p>
</blockquote>

<ul class="org-ul">
<li>Go también posee <code>zero values</code> (valores cero).
<ul class="org-ul">
<li>Son variables que son inicializadas sin un valor y toman el valor 0 de ese valor.
<ul class="org-ul">
<li>0 para los entero.
</li>
<li><code>false</code> para los booleanos.
</li>
<li><code>""</code> para los <code>strings</code>.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Constantes</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Las constantes son valores que no pueden cambiar su valor inicial.
</li>
<li>Son declaradas como las variables pero usando la palabra clave <code>const</code>.
</li>
<li>No pueden ser declaradas con la sintaxis =:.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">const</span> <span style="color: #ffc9e8;">pi</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">3.14</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Obteniendo <code>input</code></h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Necesitamos el paquete <code>fmt</code>.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">input</span> <span style="color: #bd93f9;">string</span>
<span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Scanln</span><span style="color: #61bfff;">(</span><span style="color: #ff79c6; font-style: italic;">&amp;</span><span style="color: #ffc9e8;">input</span><span style="color: #61bfff;">)</span>

fmt.<span style="color: #bd93f9;">Println</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">input</span><span style="color: #61bfff;">)</span>
</pre>
</div>

<blockquote>
<p>
El carácter <code>&amp;</code> es usado para retornar la dirección de la variable.
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">input</span> <span style="color: #bd93f9;">int</span>
<span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Scanln</span><span style="color: #61bfff;">(</span><span style="color: #ff79c6; font-style: italic;">&amp;</span><span style="color: #ffc9e8;">input</span><span style="color: #61bfff;">)</span>

fmt.<span style="color: #bd93f9;">Println</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">input</span><span style="color: #61bfff;">)</span>
</pre>
</div>

<blockquote>
<p>
En este ejemplo como declaramos la variable <code>input</code> como <code>int</code> go convertirá el input a un <code>int</code>.
</p>
</blockquote>
</div>
</div>
