Files/Lenguajes/Go/Go.org
** =if/else=
- Se usa para hacer decisiones.

#+begin_src go
x := 69

if x != 69 {
	fmt.Println("Not funny!")
}
else {
	fmt.Println("Maybe funny!")
}
#+end_src

#+begin_quote
El código dentro de los corchetes no correrá a menos que la condición se cumpla.
#+end_quote

- Es posible declarar una variable en el =if= si es que lo necesitas.

#+begin_src go
if x := 42; x > 18 { // se usa el ; para separar las dos operaciones.
	fmt.Println("Sup!")
}
else {
	fmt.Println("Sup'n!")
}
#+end_src

** =switch=
- Un =switch= es una manera más corta de hacer una secuencia de =if/else=.

#+begin_src go
num := 3

switch num {
case 1:
	fmt.Println("1")
case 2:
	fmt.Println("2")
case 3:
	fmt.Println("3")
default:
	fmt.Println(num)
}
#+end_src

- también podemos usar condiciones en los =case=.

#+begin_src go
num := 3

switch num {
	case num > 0 && x < 10:
	fmt.Println("algo")
	case num > 10:
	fmt.Println("otra cosa")
}
#+end_src

#+begin_quote
Al igual que los =if/else=, el =switch= puede tener una declaración de variable antes de las expresiones condicionales.
#+end_quote

** ciclos
- El único ciclo en Go es el ciclo =for=.
  + Este se compone de el inicio, la condición y el incremento.

#+begin_src go
for i := 0; i < 5 ; i++ {
	fmt.Println(i)
}
#+end_src

- Sin embargo podemos omitir el inicio y el incremento para hacerlo parecido a un =while=.

#+begin_src go
sum := 1
res := 0

for sum < = 1000 {
	res += sum
	sum ++
}
fmt.Println(res)
#+end_src

* Funciones
** Introducción a funciones
- Nos permiten definir un bloque de código que podemos llamar después.
- Nos permiten reusar código.
- se usa la palabra =func= para definir funciones.

#+begin_src go
func welcome() {
	fmt.Println("hello")
}
#+end_src

#+begin_quote
Hemos definido una función llamada =welcome= que imprime =Hello= en la consola.
#+end_quote

#+begin_src go
func main() {
	welcome()
	welcome()
}
#+end_src

#+begin_quote
Ahora podemos llamar a esa función cuantas veces queramos.
#+end_quote

** Argumentos
- Son una manera de pasarle información a las funciones.
- Los argumentos se comportan como una variable dentro de el cuerpo de la función.
- Cuando llamemos a esta función debemos darle los argumentos que le hayamos puesto a la función.

#+begin_src go
func welcome(name string) {
	fmt.Println("hello,"+name)
}

func main() {
	welcome("david")
	welcome("james")
}
#+end_src

#+begin_quote
En go el tipo del argumento va después de el nombre del argumento.
#+end_quote

