Publ/Lenguajes/Go/Go.html

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> <code>if/else</code></h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Se usa para hacer decisiones.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffc9e8;">x</span> <span style="color: #ff79c6; font-style: italic;">:=</span> <span style="color: #8be9fd;">69</span>

<span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ffc9e8;">x</span> <span style="color: #ff79c6; font-style: italic;">!=</span> <span style="color: #8be9fd;">69</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"Not funny!"</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
<span style="color: #bd93f9;">else</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"Maybe funny!"</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<blockquote>
<p>
El código dentro de los corchetes no correrá a menos que la condición se cumpla.
</p>
</blockquote>

<ul class="org-ul">
<li>Es posible declarar una variable en el <code>if</code> si es que lo necesitas.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ffc9e8;">x</span> <span style="color: #ff79c6; font-style: italic;">:=</span> <span style="color: #8be9fd;">42</span>; <span style="color: #ffc9e8;">x</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span> <span style="color: #8be9fd;">18</span> <span style="color: #61bfff;">{</span> <span style="color: #6272a4; font-style: italic;">// se usa el ; para separar las dos operaciones.</span>
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"Sup!"</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
<span style="color: #bd93f9;">else</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"Sup'n!"</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> <code>switch</code></h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Un <code>switch</code> es una manera más corta de hacer una secuencia de <code>if/else</code>.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffc9e8;">num</span> <span style="color: #ff79c6; font-style: italic;">:=</span> <span style="color: #8be9fd;">3</span>

<span style="color: #ff79c6; font-style: italic;">switch</span> <span style="color: #ffc9e8;">num</span> <span style="color: #61bfff;">{</span>
<span style="color: #ff79c6; font-style: italic;">case</span> <span style="color: #8be9fd;">1</span>:
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"1"</span><span style="color: #ff79c6;">)</span>
<span style="color: #ff79c6; font-style: italic;">case</span> <span style="color: #8be9fd;">2</span>:
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"2"</span><span style="color: #ff79c6;">)</span>
<span style="color: #ff79c6; font-style: italic;">case</span> <span style="color: #8be9fd;">3</span>:
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"3"</span><span style="color: #ff79c6;">)</span>
<span style="color: #ff79c6; font-style: italic;">default</span>:
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #ffc9e8;">num</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<ul class="org-ul">
<li>también podemos usar condiciones en los <code>case</code>.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffc9e8;">num</span> <span style="color: #ff79c6; font-style: italic;">:=</span> <span style="color: #8be9fd;">3</span>

<span style="color: #ff79c6; font-style: italic;">switch</span> <span style="color: #ffc9e8;">num</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ff79c6; font-style: italic;">case</span> <span style="color: #ffc9e8;">num</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span> <span style="color: #8be9fd;">0</span> <span style="color: #ff79c6; font-style: italic;">&amp;&amp;</span> <span style="color: #ffc9e8;">x</span> <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">10</span>:
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"algo"</span><span style="color: #ff79c6;">)</span>
    <span style="color: #ff79c6; font-style: italic;">case</span> <span style="color: #ffc9e8;">num</span> <span style="color: #ff79c6; font-style: italic;">&gt;</span> <span style="color: #8be9fd;">10</span>:
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"otra cosa"</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<blockquote>
<p>
Al igual que los <code>if/else</code>, el <code>switch</code> puede tener una declaración de variable antes de las expresiones condicionales.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> ciclos</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>El único ciclo en Go es el ciclo <code>for</code>.
<ul class="org-ul">
<li>Este se compone de el inicio, la condición y el incremento.
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #ffc9e8;">i</span> <span style="color: #ff79c6; font-style: italic;">:=</span> <span style="color: #8be9fd;">0</span>; <span style="color: #ffc9e8;">i</span> <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">5</span> ; <span style="color: #ffc9e8;">i</span><span style="color: #ff79c6; font-style: italic;">++</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #ffc9e8;">i</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<ul class="org-ul">
<li>Sin embargo podemos omitir el inicio y el incremento para hacerlo parecido a un <code>while</code>.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ffc9e8;">sum</span> <span style="color: #ff79c6; font-style: italic;">:=</span> <span style="color: #8be9fd;">1</span>
<span style="color: #ffc9e8;">res</span> <span style="color: #ff79c6; font-style: italic;">:=</span> <span style="color: #8be9fd;">0</span>

<span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #ffc9e8;">sum</span> <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">1000</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ffc9e8;">res</span> <span style="color: #ff79c6; font-style: italic;">+=</span> <span style="color: #ffc9e8;">sum</span>
    <span style="color: #ffc9e8;">sum</span> <span style="color: #ff79c6; font-style: italic;">++</span>
<span style="color: #61bfff;">}</span>
fmt.<span style="color: #bd93f9;">Println</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">res</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Funciones</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Introducción a funciones</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Nos permiten definir un bloque de código que podemos llamar después.
</li>
<li>Nos permiten reusar código.
</li>
<li>se usa la palabra <code>func</code> para definir funciones.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">func</span> <span style="color: #50fa7b;">welcome</span><span style="color: #61bfff;">()</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"hello"</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<blockquote>
<p>
Hemos definido una función llamada <code>welcome</code> que imprime <code>Hello</code> en la consola.
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">func</span> <span style="color: #50fa7b;">main</span><span style="color: #61bfff;">()</span> <span style="color: #61bfff;">{</span>
    <span style="color: #50fa7b;">welcome</span><span style="color: #ff79c6;">()</span>
    <span style="color: #50fa7b;">welcome</span><span style="color: #ff79c6;">()</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<blockquote>
<p>
Ahora podemos llamar a esa función cuantas veces queramos.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Argumentos</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Son una manera de pasarle información a las funciones.
</li>
<li>Los argumentos se comportan como una variable dentro de el cuerpo de la función.
</li>
<li>Cuando llamemos a esta función debemos darle los argumentos que le hayamos puesto a la función.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff79c6; font-style: italic;">func</span> <span style="color: #50fa7b;">welcome</span><span style="color: #61bfff;">(</span><span style="color: #ffc9e8;">name</span> <span style="color: #bd93f9;">string</span><span style="color: #61bfff;">)</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ffc9e8;">fmt</span>.<span style="color: #50fa7b; font-style: italic;">Println</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"hello,"</span><span style="color: #ff79c6; font-style: italic;">+</span><span style="color: #ffc9e8;">name</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>

<span style="color: #ff79c6; font-style: italic;">func</span> <span style="color: #50fa7b;">main</span><span style="color: #61bfff;">()</span> <span style="color: #61bfff;">{</span>
    <span style="color: #50fa7b;">welcome</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"david"</span><span style="color: #ff79c6;">)</span>
    <span style="color: #50fa7b;">welcome</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"james"</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>

<blockquote>
<p>
En go el tipo del argumento va después de el nombre del argumento.
</p>
</blockquote>
</div>
</div>
